---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.SiteSubRegion
source: html/c928924b-85fa-7dce-4b8b-5b0dbc209076.htm
---
# SiteSubRegion Methods

Creates a new SiteSubRegion element and adds it to the document.